grevaillot/svd_tools/headers/ATSAM4SD16C/tc1.h
#define TC1_CMR0_WAVEFORM_MODE_ASWTRG_SHIFT		22
#define TC1_CMR0_WAVEFORM_MODE_ASWTRG_MASK		0x03
/** @defgroup tc1_cmr0_waveform_mode_aswtrg ASWTRG Software Trigger Effect on TIOA
@{*/
/**@}*/


#define TC1_CMR0_WAVEFORM_MODE_AEEVT_SHIFT		20
#define TC1_CMR0_WAVEFORM_MODE_AEEVT_MASK		0x03
/** @defgroup tc1_cmr0_waveform_mode_aeevt AEEVT External Event Effect on TIOA
@{*/
/**@}*/


#define TC1_CMR0_WAVEFORM_MODE_ACPC_SHIFT		18
#define TC1_CMR0_WAVEFORM_MODE_ACPC_MASK		0x03
/** @defgroup tc1_cmr0_waveform_mode_acpc ACPC RC Compare Effect on TIOA
@{*/
/**@}*/


#define TC1_CMR0_WAVEFORM_MODE_ACPA_SHIFT		16
#define TC1_CMR0_WAVEFORM_MODE_ACPA_MASK		0x03
/** @defgroup tc1_cmr0_waveform_mode_acpa ACPA RA Compare Effect on TIOA
@{*/
/**@}*/

/** TC1_CMR0_WAVEFORM_MODE_WAVE Waveform Mode **/
#define TC1_CMR0_WAVEFORM_MODE_WAVE		(1 << 15)

#define TC1_CMR0_WAVEFORM_MODE_WAVSEL_SHIFT		13
#define TC1_CMR0_WAVEFORM_MODE_WAVSEL_MASK		0x03
/** @defgroup tc1_cmr0_waveform_mode_wavsel WAVSEL Waveform Selection
@{*/
/**@}*/

/** TC1_CMR0_WAVEFORM_MODE_ENETRG External Event Trigger Enable **/
#define TC1_CMR0_WAVEFORM_MODE_ENETRG		(1 << 12)

#define TC1_CMR0_WAVEFORM_MODE_EEVT_SHIFT		10
#define TC1_CMR0_WAVEFORM_MODE_EEVT_MASK		0x03
/** @defgroup tc1_cmr0_waveform_mode_eevt EEVT External Event Selection
@{*/
/**@}*/


#define TC1_CMR0_WAVEFORM_MODE_EEVTEDG_SHIFT		8
#define TC1_CMR0_WAVEFORM_MODE_EEVTEDG_MASK		0x03
/** @defgroup tc1_cmr0_waveform_mode_eevtedg EEVTEDG External Event Edge Selection
@{*/
/**@}*/

/** TC1_CMR0_WAVEFORM_MODE_CPCDIS Counter Clock Disable with RC Compare **/
#define TC1_CMR0_WAVEFORM_MODE_CPCDIS		(1 << 7)
/** TC1_CMR0_WAVEFORM_MODE_CPCSTOP Counter Clock Stopped with RC Compare **/
#define TC1_CMR0_WAVEFORM_MODE_CPCSTOP		(1 << 6)

#define TC1_CMR0_WAVEFORM_MODE_BURST_SHIFT		4
#define TC1_CMR0_WAVEFORM_MODE_BURST_MASK		0x03
/** @defgroup tc1_cmr0_waveform_mode_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC1_CMR0_WAVEFORM_MODE_CLKI Clock Invert **/
#define TC1_CMR0_WAVEFORM_MODE_CLKI		(1 << 3)

#define TC1_CMR0_WAVEFORM_MODE_TCCLKS_SHIFT		0
#define TC1_CMR0_WAVEFORM_MODE_TCCLKS_MASK		0x07
/** @defgroup tc1_cmr0_waveform_mode_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_smmr0 SMMR0 Stepper Motor Mode Register (channel = 0)
@{*/

/** TC1_SMMR0_DOWN Down Count **/
#define TC1_SMMR0_DOWN		(1 << 1)
/** TC1_SMMR0_GCEN Gray Count Enable **/
#define TC1_SMMR0_GCEN		(1 << 0)

/**@}*/

/** @defgroup tc1_cv0 CV0 Counter Value (channel = 0)
@{*/


#define TC1_CV0_CV_SHIFT		0
#define TC1_CV0_CV_MASK		0xffffffff
/** @defgroup tc1_cv0_cv CV Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_ra0 RA0 Register A (channel = 0)
@{*/


#define TC1_RA0_RA_SHIFT		0
#define TC1_RA0_RA_MASK		0xffffffff
/** @defgroup tc1_ra0_ra RA Register A
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_rb0 RB0 Register B (channel = 0)
@{*/


#define TC1_RB0_RB_SHIFT		0
#define TC1_RB0_RB_MASK		0xffffffff
/** @defgroup tc1_rb0_rb RB Register B
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_rc0 RC0 Register C (channel = 0)
@{*/


#define TC1_RC0_RC_SHIFT		0
#define TC1_RC0_RC_MASK		0xffffffff
/** @defgroup tc1_rc0_rc RC Register C
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_sr0 SR0 Status Register (channel = 0)
@{*/

/** TC1_SR0_MTIOB TIOB Mirror **/
#define TC1_SR0_MTIOB		(1 << 18)
/** TC1_SR0_MTIOA TIOA Mirror **/
#define TC1_SR0_MTIOA		(1 << 17)
/** TC1_SR0_CLKSTA Clock Enabling Status **/
#define TC1_SR0_CLKSTA		(1 << 16)
/** TC1_SR0_ETRGS External Trigger Status (cleared on read) **/
#define TC1_SR0_ETRGS		(1 << 7)
/** TC1_SR0_LDRBS RB Loading Status (cleared on read) **/
#define TC1_SR0_LDRBS		(1 << 6)
/** TC1_SR0_LDRAS RA Loading Status (cleared on read) **/
#define TC1_SR0_LDRAS		(1 << 5)
/** TC1_SR0_CPCS RC Compare Status (cleared on read) **/
#define TC1_SR0_CPCS		(1 << 4)
/** TC1_SR0_CPBS RB Compare Status (cleared on read) **/
#define TC1_SR0_CPBS		(1 << 3)
/** TC1_SR0_CPAS RA Compare Status (cleared on read) **/
#define TC1_SR0_CPAS		(1 << 2)
/** TC1_SR0_LOVRS Load Overrun Status (cleared on read) **/
#define TC1_SR0_LOVRS		(1 << 1)
/** TC1_SR0_COVFS Counter Overflow Status (cleared on read) **/
#define TC1_SR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc1_ier0 IER0 Interrupt Enable Register (channel = 0)
@{*/

/** TC1_IER0_ETRGS External Trigger **/
#define TC1_IER0_ETRGS		(1 << 7)
/** TC1_IER0_LDRBS RB Loading **/
#define TC1_IER0_LDRBS		(1 << 6)
/** TC1_IER0_LDRAS RA Loading **/
#define TC1_IER0_LDRAS		(1 << 5)
/** TC1_IER0_CPCS RC Compare **/
#define TC1_IER0_CPCS		(1 << 4)
/** TC1_IER0_CPBS RB Compare **/
#define TC1_IER0_CPBS		(1 << 3)
/** TC1_IER0_CPAS RA Compare **/
#define TC1_IER0_CPAS		(1 << 2)
/** TC1_IER0_LOVRS Load Overrun **/
#define TC1_IER0_LOVRS		(1 << 1)
/** TC1_IER0_COVFS Counter Overflow **/
#define TC1_IER0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc1_idr0 IDR0 Interrupt Disable Register (channel = 0)
@{*/

/** TC1_IDR0_ETRGS External Trigger **/
#define TC1_IDR0_ETRGS		(1 << 7)
/** TC1_IDR0_LDRBS RB Loading **/
#define TC1_IDR0_LDRBS		(1 << 6)
/** TC1_IDR0_LDRAS RA Loading **/
#define TC1_IDR0_LDRAS		(1 << 5)
/** TC1_IDR0_CPCS RC Compare **/
#define TC1_IDR0_CPCS		(1 << 4)
/** TC1_IDR0_CPBS RB Compare **/
#define TC1_IDR0_CPBS		(1 << 3)
/** TC1_IDR0_CPAS RA Compare **/
#define TC1_IDR0_CPAS		(1 << 2)
/** TC1_IDR0_LOVRS Load Overrun **/
#define TC1_IDR0_LOVRS		(1 << 1)
/** TC1_IDR0_COVFS Counter Overflow **/
#define TC1_IDR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc1_imr0 IMR0 Interrupt Mask Register (channel = 0)
@{*/

/** TC1_IMR0_ETRGS External Trigger **/
#define TC1_IMR0_ETRGS		(1 << 7)
/** TC1_IMR0_LDRBS RB Loading **/
#define TC1_IMR0_LDRBS		(1 << 6)
/** TC1_IMR0_LDRAS RA Loading **/
#define TC1_IMR0_LDRAS		(1 << 5)
/** TC1_IMR0_CPCS RC Compare **/
#define TC1_IMR0_CPCS		(1 << 4)
/** TC1_IMR0_CPBS RB Compare **/
#define TC1_IMR0_CPBS		(1 << 3)
/** TC1_IMR0_CPAS RA Compare **/
#define TC1_IMR0_CPAS		(1 << 2)
/** TC1_IMR0_LOVRS Load Overrun **/
#define TC1_IMR0_LOVRS		(1 << 1)
/** TC1_IMR0_COVFS Counter Overflow **/
#define TC1_IMR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc1_ccr1 CCR1 Channel Control Register (channel = 1)
@{*/

/** TC1_CCR1_SWTRG Software Trigger Command **/
#define TC1_CCR1_SWTRG		(1 << 2)
/** TC1_CCR1_CLKDIS Counter Clock Disable Command **/
#define TC1_CCR1_CLKDIS		(1 << 1)
/** TC1_CCR1_CLKEN Counter Clock Enable Command **/
#define TC1_CCR1_CLKEN		(1 << 0)

/**@}*/

/** @defgroup tc1_cmr1 CMR1 Channel Mode Register (channel = 1)
@{*/


#define TC1_CMR1_LDRB_SHIFT		18
#define TC1_CMR1_LDRB_MASK		0x03
/** @defgroup tc1_cmr1_ldrb LDRB RB Loading Edge Selection
@{*/
/**@}*/


#define TC1_CMR1_LDRA_SHIFT		16
#define TC1_CMR1_LDRA_MASK		0x03
/** @defgroup tc1_cmr1_ldra LDRA RA Loading Edge Selection
@{*/
/**@}*/

