grevaillot/svd_tools/headers/ATSAM4SD16C/tc1.h
/** TC1_CMR2_WAVE Waveform Mode **/
#define TC1_CMR2_WAVE		(1 << 15)
/** TC1_CMR2_CPCTRG RC Compare Trigger Enable **/
#define TC1_CMR2_CPCTRG		(1 << 14)
/** TC1_CMR2_ABETRG TIOA or TIOB External Trigger Selection **/
#define TC1_CMR2_ABETRG		(1 << 10)

#define TC1_CMR2_ETRGEDG_SHIFT		8
#define TC1_CMR2_ETRGEDG_MASK		0x03
/** @defgroup tc1_cmr2_etrgedg ETRGEDG External Trigger Edge Selection
@{*/
/**@}*/

/** TC1_CMR2_LDBDIS Counter Clock Disable with RB Loading **/
#define TC1_CMR2_LDBDIS		(1 << 7)
/** TC1_CMR2_LDBSTOP Counter Clock Stopped with RB Loading **/
#define TC1_CMR2_LDBSTOP		(1 << 6)

#define TC1_CMR2_BURST_SHIFT		4
#define TC1_CMR2_BURST_MASK		0x03
/** @defgroup tc1_cmr2_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC1_CMR2_CLKI Clock Invert **/
#define TC1_CMR2_CLKI		(1 << 3)

#define TC1_CMR2_TCCLKS_SHIFT		0
#define TC1_CMR2_TCCLKS_MASK		0x07
/** @defgroup tc1_cmr2_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_cmr2_waveform_mode CMR2WAVEFORMMODE Channel Mode Register (channel = 2)
@{*/


#define TC1_CMR2_WAVEFORM_MODE_BSWTRG_SHIFT		30
#define TC1_CMR2_WAVEFORM_MODE_BSWTRG_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_bswtrg BSWTRG Software Trigger Effect on TIOB
@{*/
/**@}*/


#define TC1_CMR2_WAVEFORM_MODE_BEEVT_SHIFT		28
#define TC1_CMR2_WAVEFORM_MODE_BEEVT_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_beevt BEEVT External Event Effect on TIOB
@{*/
/**@}*/


#define TC1_CMR2_WAVEFORM_MODE_BCPC_SHIFT		26
#define TC1_CMR2_WAVEFORM_MODE_BCPC_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_bcpc BCPC RC Compare Effect on TIOB
@{*/
/**@}*/


#define TC1_CMR2_WAVEFORM_MODE_BCPB_SHIFT		24
#define TC1_CMR2_WAVEFORM_MODE_BCPB_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_bcpb BCPB RB Compare Effect on TIOB
@{*/
/**@}*/


#define TC1_CMR2_WAVEFORM_MODE_ASWTRG_SHIFT		22
#define TC1_CMR2_WAVEFORM_MODE_ASWTRG_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_aswtrg ASWTRG Software Trigger Effect on TIOA
@{*/
/**@}*/


#define TC1_CMR2_WAVEFORM_MODE_AEEVT_SHIFT		20
#define TC1_CMR2_WAVEFORM_MODE_AEEVT_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_aeevt AEEVT External Event Effect on TIOA
@{*/
/**@}*/


#define TC1_CMR2_WAVEFORM_MODE_ACPC_SHIFT		18
#define TC1_CMR2_WAVEFORM_MODE_ACPC_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_acpc ACPC RC Compare Effect on TIOA
@{*/
/**@}*/


#define TC1_CMR2_WAVEFORM_MODE_ACPA_SHIFT		16
#define TC1_CMR2_WAVEFORM_MODE_ACPA_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_acpa ACPA RA Compare Effect on TIOA
@{*/
/**@}*/

/** TC1_CMR2_WAVEFORM_MODE_WAVE Waveform Mode **/
#define TC1_CMR2_WAVEFORM_MODE_WAVE		(1 << 15)

#define TC1_CMR2_WAVEFORM_MODE_WAVSEL_SHIFT		13
#define TC1_CMR2_WAVEFORM_MODE_WAVSEL_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_wavsel WAVSEL Waveform Selection
@{*/
/**@}*/

/** TC1_CMR2_WAVEFORM_MODE_ENETRG External Event Trigger Enable **/
#define TC1_CMR2_WAVEFORM_MODE_ENETRG		(1 << 12)

#define TC1_CMR2_WAVEFORM_MODE_EEVT_SHIFT		10
#define TC1_CMR2_WAVEFORM_MODE_EEVT_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_eevt EEVT External Event Selection
@{*/
/**@}*/


#define TC1_CMR2_WAVEFORM_MODE_EEVTEDG_SHIFT		8
#define TC1_CMR2_WAVEFORM_MODE_EEVTEDG_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_eevtedg EEVTEDG External Event Edge Selection
@{*/
/**@}*/

/** TC1_CMR2_WAVEFORM_MODE_CPCDIS Counter Clock Disable with RC Compare **/
#define TC1_CMR2_WAVEFORM_MODE_CPCDIS		(1 << 7)
/** TC1_CMR2_WAVEFORM_MODE_CPCSTOP Counter Clock Stopped with RC Compare **/
#define TC1_CMR2_WAVEFORM_MODE_CPCSTOP		(1 << 6)

#define TC1_CMR2_WAVEFORM_MODE_BURST_SHIFT		4
#define TC1_CMR2_WAVEFORM_MODE_BURST_MASK		0x03
/** @defgroup tc1_cmr2_waveform_mode_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC1_CMR2_WAVEFORM_MODE_CLKI Clock Invert **/
#define TC1_CMR2_WAVEFORM_MODE_CLKI		(1 << 3)

#define TC1_CMR2_WAVEFORM_MODE_TCCLKS_SHIFT		0
#define TC1_CMR2_WAVEFORM_MODE_TCCLKS_MASK		0x07
/** @defgroup tc1_cmr2_waveform_mode_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_smmr2 SMMR2 Stepper Motor Mode Register (channel = 2)
@{*/

/** TC1_SMMR2_DOWN Down Count **/
#define TC1_SMMR2_DOWN		(1 << 1)
/** TC1_SMMR2_GCEN Gray Count Enable **/
#define TC1_SMMR2_GCEN		(1 << 0)

/**@}*/

/** @defgroup tc1_cv2 CV2 Counter Value (channel = 2)
@{*/


#define TC1_CV2_CV_SHIFT		0
#define TC1_CV2_CV_MASK		0xffffffff
/** @defgroup tc1_cv2_cv CV Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_ra2 RA2 Register A (channel = 2)
@{*/


#define TC1_RA2_RA_SHIFT		0
#define TC1_RA2_RA_MASK		0xffffffff
/** @defgroup tc1_ra2_ra RA Register A
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_rb2 RB2 Register B (channel = 2)
@{*/


#define TC1_RB2_RB_SHIFT		0
#define TC1_RB2_RB_MASK		0xffffffff
/** @defgroup tc1_rb2_rb RB Register B
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_rc2 RC2 Register C (channel = 2)
@{*/


#define TC1_RC2_RC_SHIFT		0
#define TC1_RC2_RC_MASK		0xffffffff
/** @defgroup tc1_rc2_rc RC Register C
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_sr2 SR2 Status Register (channel = 2)
@{*/

/** TC1_SR2_MTIOB TIOB Mirror **/
#define TC1_SR2_MTIOB		(1 << 18)
/** TC1_SR2_MTIOA TIOA Mirror **/
#define TC1_SR2_MTIOA		(1 << 17)
/** TC1_SR2_CLKSTA Clock Enabling Status **/
#define TC1_SR2_CLKSTA		(1 << 16)
/** TC1_SR2_ETRGS External Trigger Status (cleared on read) **/
#define TC1_SR2_ETRGS		(1 << 7)
/** TC1_SR2_LDRBS RB Loading Status (cleared on read) **/
#define TC1_SR2_LDRBS		(1 << 6)
/** TC1_SR2_LDRAS RA Loading Status (cleared on read) **/
#define TC1_SR2_LDRAS		(1 << 5)
/** TC1_SR2_CPCS RC Compare Status (cleared on read) **/
#define TC1_SR2_CPCS		(1 << 4)
/** TC1_SR2_CPBS RB Compare Status (cleared on read) **/
#define TC1_SR2_CPBS		(1 << 3)
/** TC1_SR2_CPAS RA Compare Status (cleared on read) **/
#define TC1_SR2_CPAS		(1 << 2)
/** TC1_SR2_LOVRS Load Overrun Status (cleared on read) **/
#define TC1_SR2_LOVRS		(1 << 1)
/** TC1_SR2_COVFS Counter Overflow Status (cleared on read) **/
#define TC1_SR2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc1_ier2 IER2 Interrupt Enable Register (channel = 2)
@{*/

