grevaillot/svd_tools/headers/ATSAM4SD16C/tc1.h
/** TC1_IER2_ETRGS External Trigger **/
#define TC1_IER2_ETRGS		(1 << 7)
/** TC1_IER2_LDRBS RB Loading **/
#define TC1_IER2_LDRBS		(1 << 6)
/** TC1_IER2_LDRAS RA Loading **/
#define TC1_IER2_LDRAS		(1 << 5)
/** TC1_IER2_CPCS RC Compare **/
#define TC1_IER2_CPCS		(1 << 4)
/** TC1_IER2_CPBS RB Compare **/
#define TC1_IER2_CPBS		(1 << 3)
/** TC1_IER2_CPAS RA Compare **/
#define TC1_IER2_CPAS		(1 << 2)
/** TC1_IER2_LOVRS Load Overrun **/
#define TC1_IER2_LOVRS		(1 << 1)
/** TC1_IER2_COVFS Counter Overflow **/
#define TC1_IER2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc1_idr2 IDR2 Interrupt Disable Register (channel = 2)
@{*/

/** TC1_IDR2_ETRGS External Trigger **/
#define TC1_IDR2_ETRGS		(1 << 7)
/** TC1_IDR2_LDRBS RB Loading **/
#define TC1_IDR2_LDRBS		(1 << 6)
/** TC1_IDR2_LDRAS RA Loading **/
#define TC1_IDR2_LDRAS		(1 << 5)
/** TC1_IDR2_CPCS RC Compare **/
#define TC1_IDR2_CPCS		(1 << 4)
/** TC1_IDR2_CPBS RB Compare **/
#define TC1_IDR2_CPBS		(1 << 3)
/** TC1_IDR2_CPAS RA Compare **/
#define TC1_IDR2_CPAS		(1 << 2)
/** TC1_IDR2_LOVRS Load Overrun **/
#define TC1_IDR2_LOVRS		(1 << 1)
/** TC1_IDR2_COVFS Counter Overflow **/
#define TC1_IDR2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc1_imr2 IMR2 Interrupt Mask Register (channel = 2)
@{*/

/** TC1_IMR2_ETRGS External Trigger **/
#define TC1_IMR2_ETRGS		(1 << 7)
/** TC1_IMR2_LDRBS RB Loading **/
#define TC1_IMR2_LDRBS		(1 << 6)
/** TC1_IMR2_LDRAS RA Loading **/
#define TC1_IMR2_LDRAS		(1 << 5)
/** TC1_IMR2_CPCS RC Compare **/
#define TC1_IMR2_CPCS		(1 << 4)
/** TC1_IMR2_CPBS RB Compare **/
#define TC1_IMR2_CPBS		(1 << 3)
/** TC1_IMR2_CPAS RA Compare **/
#define TC1_IMR2_CPAS		(1 << 2)
/** TC1_IMR2_LOVRS Load Overrun **/
#define TC1_IMR2_LOVRS		(1 << 1)
/** TC1_IMR2_COVFS Counter Overflow **/
#define TC1_IMR2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc1_bcr BCR Block Control Register
@{*/

/** TC1_BCR_SYNC Synchro Command **/
#define TC1_BCR_SYNC		(1 << 0)

/**@}*/

/** @defgroup tc1_bmr BMR Block Mode Register
@{*/


#define TC1_BMR_MAXFILT_SHIFT		20
#define TC1_BMR_MAXFILT_MASK		0x3f
/** @defgroup tc1_bmr_maxfilt MAXFILT Maximum Filter
@{*/
/**@}*/

/** TC1_BMR_IDXPHB Index Pin is PHB Pin **/
#define TC1_BMR_IDXPHB		(1 << 17)
/** TC1_BMR_SWAP Swap PHA and PHB **/
#define TC1_BMR_SWAP		(1 << 16)
/** TC1_BMR_INVIDX Inverted Index **/
#define TC1_BMR_INVIDX		(1 << 15)
/** TC1_BMR_INVB Inverted PHB **/
#define TC1_BMR_INVB		(1 << 14)
/** TC1_BMR_INVA Inverted PHA **/
#define TC1_BMR_INVA		(1 << 13)
/** TC1_BMR_EDGPHA Edge on PHA Count Mode **/
#define TC1_BMR_EDGPHA		(1 << 12)
/** TC1_BMR_QDTRANS Quadrature Decoding Transparent **/
#define TC1_BMR_QDTRANS		(1 << 11)
/** TC1_BMR_SPEEDEN Speed Enabled **/
#define TC1_BMR_SPEEDEN		(1 << 10)
/** TC1_BMR_POSEN Position Enabled **/
#define TC1_BMR_POSEN		(1 << 9)
/** TC1_BMR_QDEN Quadrature Decoder Enabled **/
#define TC1_BMR_QDEN		(1 << 8)

#define TC1_BMR_TC2XC2S_SHIFT		4
#define TC1_BMR_TC2XC2S_MASK		0x03
/** @defgroup tc1_bmr_tc2xc2s TC2XC2S External Clock Signal 2 Selection
@{*/
/**@}*/


#define TC1_BMR_TC1XC1S_SHIFT		2
#define TC1_BMR_TC1XC1S_MASK		0x03
/** @defgroup tc1_bmr_tc1xc1s TC1XC1S External Clock Signal 1 Selection
@{*/
/**@}*/


#define TC1_BMR_TC0XC0S_SHIFT		0
#define TC1_BMR_TC0XC0S_MASK		0x03
/** @defgroup tc1_bmr_tc0xc0s TC0XC0S External Clock Signal 0 Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc1_qier QIER QDEC Interrupt Enable Register
@{*/

/** TC1_QIER_QERR Quadrature Error **/
#define TC1_QIER_QERR		(1 << 2)
/** TC1_QIER_DIRCHG Direction Change **/
#define TC1_QIER_DIRCHG		(1 << 1)
/** TC1_QIER_IDX Index **/
#define TC1_QIER_IDX		(1 << 0)

/**@}*/

/** @defgroup tc1_qidr QIDR QDEC Interrupt Disable Register
@{*/

/** TC1_QIDR_QERR Quadrature Error **/
#define TC1_QIDR_QERR		(1 << 2)
/** TC1_QIDR_DIRCHG Direction Change **/
#define TC1_QIDR_DIRCHG		(1 << 1)
/** TC1_QIDR_IDX Index **/
#define TC1_QIDR_IDX		(1 << 0)

/**@}*/

/** @defgroup tc1_qimr QIMR QDEC Interrupt Mask Register
@{*/

/** TC1_QIMR_QERR Quadrature Error **/
#define TC1_QIMR_QERR		(1 << 2)
/** TC1_QIMR_DIRCHG Direction Change **/
#define TC1_QIMR_DIRCHG		(1 << 1)
/** TC1_QIMR_IDX Index **/
#define TC1_QIMR_IDX		(1 << 0)

/**@}*/

/** @defgroup tc1_qisr QISR QDEC Interrupt Status Register
@{*/

/** TC1_QISR_DIR Direction **/
#define TC1_QISR_DIR		(1 << 8)
/** TC1_QISR_QERR Quadrature Error **/
#define TC1_QISR_QERR		(1 << 2)
/** TC1_QISR_DIRCHG Direction Change **/
#define TC1_QISR_DIRCHG		(1 << 1)
/** TC1_QISR_IDX Index **/
#define TC1_QISR_IDX		(1 << 0)

/**@}*/

/** @defgroup tc1_fmr FMR Fault Mode Register
@{*/

/** TC1_FMR_ENCF1 Enable Compare Fault Channel 1 **/
#define TC1_FMR_ENCF1		(1 << 1)
/** TC1_FMR_ENCF0 Enable Compare Fault Channel 0 **/
#define TC1_FMR_ENCF0		(1 << 0)

/**@}*/

/** @defgroup tc1_wpmr WPMR Write Protection Mode Register
@{*/


#define TC1_WPMR_WPKEY_SHIFT		8
#define TC1_WPMR_WPKEY_MASK		0xffffff
/** @defgroup tc1_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** TC1_WPMR_WPEN Write Protection Enable **/
#define TC1_WPMR_WPEN		(1 << 0)

/**@}*/
